{"submission_id": "suJ1z1UX2t", "title": "Supervised Dimension Contrastive Learning", "authors": ["Jaemyung Yu", "SungHyun Baek", "Jongsuk Kim", "Junmo Kim"], "submission_date": "2025-01-25 17:03:56", "abstract": "Self-supervised learning has emerged as an effective pre-training strategy for representation learning using large-scale unlabeled data. However, models pre-trained with self-supervised learning still require supervised fine-tuning to achieve optimal task-specific performance. Due to the lack of label utilization, it is difficult to accurately distinguish between positive and hard negative samples. Supervised contrastive learning methods address the limitation by leveraging labels, but they focus on global representations, leading to limited feature diversity and high cross-correlation between representation dimensions. To address these challenges, we propose Supervised Dimension Contrastive Learning, a novel approach that combines supervision with dimension-wise contrastive learning. Inspired by redundancy reduction techniques like Barlow Twins, this approach reduces cross-correlation between embedding dimensions while enhancing class discriminability. The aggregate function combines the embedding dimensions to generate predicted class variables, which are optimized to correlate with their corresponding class labels. Orthogonal regularization is applied to ensure the full utilization of all dimensions by enforcing full-rankness in the aggregate function. We evaluate our method on both in-domain supervised classification tasks and out-of-domain transfer learning tasks, demonstrating its superior performance compared to traditional supervised learning, supervised contrastive learning, and self-supervised learning methods. Our results show that the proposed method effectively reduces inter-dimensional correlation and enhances class discriminability, proving its generalizability across various downstream tasks.", "reviews": [{"summary": "This paper argues that representations learned by supervised contrastive learning methods have limited feature diversity and high cross-correlation between dimensions. The authors propose an approach to learn representations that are both augmentation-invariant and dimension-wise decorrelated, while also being discriminative for classification. They achieve this by extending Barlow Twins, a dimension contrastive learning model, to supervised dimension contrastive learning. Specifically, they introduce a discriminativeness loss instead of the cross-entropy loss, consisting of a class correlation loss and an orthogonal regularization loss. Experimental results show that the proposed SupDCL performs well on both in-domain supervised classification tasks and out-of-domain transfer learning tasks.", "soundness": 3, "presentation": 3, "contribution": 3, "strengths": "The idea of this paper is to combine SupCon (supervised contrastive learning) with Barlow Twins (decorrelated features). The specific approach involves introducing a discriminativeness loss to leverage the supervised labels. The motivation and approach are presented very clearly. The authors also provide experiments, analysis, and evaluation metrics to demonstrate the effectiveness of the proposed method.", "weaknesses": "I believe the experiments could be strengthened, and there are some minor points that would enhance the clarity of the paper. These are outlined in more detail in the Questions section.", "questions": "1. This work aims to extend Barlow Twins to a supervised version. A straightforward extension model could be a combination of Barlow Twins and SupCon, where, instead of generating two augmentations $X^A$ and $X^B$ from image $X$, $X^B$ is selected from another image that shares the same class as image $X$. In Table 2, I would like to see the results of this model.\n\n2. Another straightforward extension is to use a cross-entropy loss function instead of the proposed discriminativeness loss function to leverage the supervised labels. While you have compared this model in Table 3, comparing the results in Table 1 and Table 2 would also be worthwhile.\n\n3. In Table 3, you mention the representation space and embedding space; however, in the methods section and Figure 2, there is no reference to the representation space. You have defined the embedding space, $Z$, as an $M-dimensional$ vector, but it is unclear which vector you refer to as the representation vector.\n\n4. Similarly, Section 4.2 does not clarify what the representation $Y$, a $D-dimensional$ vector, refers to.\n\n5. In lines 371-374, when $t_d = 0.1$, Barlow Twins achieves 1320, which seems to be the lowest count rather than the highest as described. Is there a mistake here?\n\n6. Visualization: Could you visualize the embedding space or representation space (with clearer references if possible) of different methods, along with the different dimensions of those representations? This would help to better understand how the proposed method achieves improved decorrelation and discriminative representations.\n\n\nMinors:\n1. It would be better to mark all the best numbers in all tables in bold.\n\n2. In Table 2, add arrows to indicate whether larger or smaller values are better, and mark the best value in bold.\n\n3. Figure 1 can be split into two separate figures, as the third sub-figure is not on the same scale as the other two.\n\n4. In lines 353-358, 645 (SupDCL) vs. 532 (SupCon) is described as outperforming, while 645 (SupDCL) vs. 904 (Barlow Twins) is described as comparable?", "flag_for_ethics_review": ["No ethics review needed."], "rating": 5, "confidence": 5, "code_of_conduct": "Yes"}, {"summary": "The paper introduces Supervised Dimension Contrastive Learning (SupDCL), which combines supervision with dimension-wise contrastive learning. It targets limitations in supervised contrastive learning (high cross-correlation and limited feature diversity) by reducing redundancy in embedding dimensions while enhancing class discriminability.", "soundness": 2, "presentation": 3, "contribution": 2, "strengths": "- The integration of dimension contrastive learning with supervision to enhance feature diversity makes sense. SupDCL’s approach to reducing cross-correlation among dimensions to improve generalization, particularly in transfer learning tasks, is a well-justified.\n- The evaluation covers both in-domain and out-domain tasks on different datasets, providing a clear comparison of SupDCL against multiple baselines, including self-supervised and supervised learning methods.\n- Extensive ablation studies that analyze each component of SupDCL’s loss function.\n- The paper acknowledges the limitations of SupDCL, specifically its reliance on fixed-form class labels. It provides suggestions for handling these limitations through future work.", "weaknesses": "- The paper introduces orthogonal regularization and decorrelation strategies to improve feature diversity, but it lacks a theoretical foundation to show why these particular choices are necessary. While the empirical results show improved performance, a lack of formal justification leaves the effectiveness of these strategies unclear.\n- While SupDCL outperforms SupCon in out-doman tasks, it underperforms SupCon in in-doman tasks.\n- SupDCL borrows heavily from existing redundancy reduction techniques (Barlow Twins) without significantly advancing the state of contrastive learning. The contribution of introducing supervision to dimension contrastive learning is incremental and could be viewed as a straightforward application of existing techniques.", "questions": "- Why is feature discriminative inportant for supervised contrastive learning? Figure 1 and experiments show that SupDCL underperforms SupCon in in-doman tasks.\n- What is $L_{inv}$ and $L_{decorr}$ is Eq (7)? They are not explained.", "flag_for_ethics_review": ["No ethics review needed."], "rating": 5, "confidence": 5, "code_of_conduct": "Yes"}, {"summary": "This paper enhances Barlow Twins by using the class-correlation loss and orthogonal regularization loss. The class correlation loss uses supervision information, and the orthogonal regularization loss enforces the aggregate function to be full-rank. These additional losses positively affect the overall performance. Through numerical experiments on in-domain classification and out-domain transfer learning tasks, the proposed SupDCL demonstrated superior performance.", "soundness": 2, "presentation": 2, "contribution": 2, "strengths": "- The proposed method demonstrated superior performance on in-domain classification and out-domain transfer learning tasks.", "weaknesses": "- The class correlation and orthogonal regularization losses have not been investigated in Barlow Twins, but such losses are often investigated in other methods or areas.\n- According to Table 4, most of the performance gain of the proposed method compared with Barlow Twins comes from supervision.", "questions": "- What is an intuition that the proposed method improved performance on out-domain transfer learning tasks? \n- Based on Figure 1, the proposed method inherits the superior out-domain performance from Barlow Twins. The other regularization or loss terms are likely to obtain improvement similar to the proposed method from Barlow twins.\n- Are there any theoretical insights about the performance of the proposed method?\n- Can we use the proposed method without the class correlation loss as a self-supervised learning method? If so, does this outperform the existing methods?\n- Regarding Table 4, is there any discussion of the performance of Barlow Twins plus the orthogonal regularization loss?\n- In Table 3(b), the existing methods increase performance as the projector dimensionality increases, but the proposed method decreases after 128. Is there any interpretation for that?", "flag_for_ethics_review": ["No ethics review needed."], "rating": 5, "confidence": 4, "code_of_conduct": "Yes"}, {"summary": "Motivated by Barlow Twins, this paper proposes a method to constrain the feature diversity in supervised contrastive learning. Experimental results show the effectiveness of the proposed method.", "soundness": 2, "presentation": 3, "contribution": 2, "strengths": "From experimental section, we can see that the proposed method performance well in OOD scenario. This is interesting and validates to some extent that feature diversity does correlate with the generalizability of feature representations.", "weaknesses": "1. The novelty of this paper is really limited. This article does not explain the motivation for CLASS CORRELATION and FULL RANK AGGREGATION to be proposed. At the same time, no intuitive insight or theoretical analysis is given as to why CLASS CORRELATION and FULL RANK AGGREGATION promote supervised comparative learning performance.\n\n2. The related work section is also quite weak. The authors have not done a good job of highlighting the developmental lineage of self-supervised learning, supervised comparative learning, and the connections and differences between the different algorithms. And also did not highlight the advantages and footholds of the method proposed in this paper.", "questions": "1. Why can CLASS CORRELATION encourage the embedding dimensions to be not only augmentation-invariant and decorrelated but also discriminative for the supervised classification task? As we can see, CLASS CORRELATION is only a metric of Correlational Relationship.\n\n2. Please give the theoretical analysis or related references to the statement: To guarantee that all embedding dimensions contribute to class separability, every embedding dimension should play a role in generating the predicted class variables through the aggregate function. It can be achieved by enforcing aggregate function is full-rank.", "flag_for_ethics_review": ["No ethics review needed."], "rating": 5, "confidence": 5, "code_of_conduct": "Yes"}], "metareview": null, "comments": {"author": [{"title": "Clarification of Our Framework", "comment": "Dear Reviewers,\n\nWe thank the reviewers for their valuable feedback, which guided us to strengthen the **theoretical and empirical justification** of our proposed dimension-based framework. Initially, we focused on the motivations behind our approach. Now, we theoretically and empirically demonstrate that all three components addresses specific challenges. Specifically, we decompose the mutual information between class labels and learned representations into two components (refer to Revised G2): **diversity** and **discriminativeness**, and together, they form a **comprehensive framework** for robust generalization. All justifications have been revised and reflected in the updated version of the paper.\n\n$I(C;Y)$\n\n$=\\underbrace{H(Y)}_{\\text{diversity}}$ “the total information capacity of the learned representation $Y$”\n\n$-\\underbrace{(H(\\hat{C}|C)+H(Y_\\text{null}))}_{\\text{discriminativeness}}$ “the uncertainty and information loss related to the aggregation process”\n\n\n1. Dimension Decorrelation - Maximizing $H(Y)$:\n    - Reduces inter-dimension correlation using Barlow Twins (BT), theoretically shown to **increase information capacity of representation** (Revised G2 of the global response and Appendix A.2).\n    - Empirically, it improves generalization performance, as evidenced by the relationship between dimension correlation and whole-domain accuracy (Figure 1) and the effectiveness of BT+CE over CE alone (Table B).\n\n\n2. Class Correlation - Minimizing $H(\\hat{C}|C)$:\n    - A novel method for robust distributional alignment, theoretically shown to **be invariant to covariate shift**, and minimize distance between predicted and true class distributions (Revised G2 of the global response and Appendix A.3.1).\n    - Empirically, class correlation improves in-domain and out-domain performance, consistently outperforming CE across all settings (Table B).\n\n\n3. Full-rank Aggregation - Minimizing $H(Y_\\text{null})$:\n    - Preserves class-relevant information of representation, theoretically shown to **minimize information capacity of null space** (Revised G2 of the global response and Appendix A.3.2).\n    - Empirically, comparisons such as BT+CE vs. BT+CE+Orthogonal and SupDCL w/o Orthogonal vs. SupDCL confirm its significant contribution to both in-domain and out-domain performance (Table B).\n\nCombining these components, our method achieves **state-of-the-art whole-domain generalization**, outperforming all supervised and self-supervised baselines across in-domain and out-domain tasks (Table C).\n\n\n**Table C**. In-domain classification and out-domain transfer learning. Linear evaluation performance comparison on 10 downstream datasets, for ResNet-50 pre-trained on ImageNet-1K.\n\n| **Method** | **In-domain (IN1K)** | **Average out-domain (10 datasets)** | **Whole-domain (all 11 datasets weighted equally)** | **Whole-domain (50% in-domain, 50% averaged out-domain)** |\n| --- | --- | --- | --- | --- |\n| Supervised | 76.1 | 74.5 | 74.6 | 75.3 |\n| *Self-supervised Representation Learning:* |  |  |  |  |\n| SimCLR | 69.1 | 73.0 | 72.6 | 71.0 |\n| Barlow Twins | 73.2 | 79.0 | 78.5 | 76.1 |\n| SwAV | 75.3 | 79.0 | 78.7 | 77.2 |\n| MoCo v3 | 71.1 | 79.4 | 78.7 | 75.3 |\n| DINO | 75.3 | 80.3 | 79.9 | 77.8 |\n| *Supervised Representation Learning:* |  |  |  |  |\n| SupCon | 77.9 | 77.8 | 77.8 | 77.9 |\n| PaCo | 78.7 | 69.4 | 70.2 | 74.1 |\n| GPaCo | **79.5** | 68.8 | 69.8 | 74.2 |\n| **SupDCL-1024 (Ours)** | 78.2 | 78.9 | 78.9 | 78.6 |\n| **SupDCL (Ours)** | 77.5 | **80.8** | **80.5** | **79.2** |\n\n\n**Table B.** Comparison of SupDCL and straightforward extensions of Barlow Twins with cross-entropy loss\n\n| **Method** | **In-domain (CIFAR-100)** | **Average Out-domain** |\n| --- | --- | --- |\n| Barlow Twins | 52.6% | 39.1% |\n| Barlow Twins + CE | 72.6% | 39.6% |\n| Barlow Twins + CE with Orthogonalization | 73.8% | 40.8% |\n| SupDCL w/o Orthogonalization | 73.8% | 41.0% |\n| SupDCL (Ours) | **74.2%** | **42.0%** |"}], "reviewer": [{"title": "Response to Rebuttal", "comment": "Thank you for providing additional proof. However, there are still some important concerns that have not been addressed. \n\nFor **Global Response (2-1/4, Revised)**: \n\n1) Why can Null-Range Decomposition satisfy the law of total entropy?\n2) Only constrain the **one-to-one mapping** can not lead to the conclusion: $H(Y_{\\rm range}|C)=H(AY_{\\rm range}|C)=H(\\hat C|C)$. This should be bijection.\n3) $A$ is designed to capture all $C$-relevant information in $Y$. This is a hypothesis, thus, we can use this like a Definitive Conclusion, thus, $H(Y_{\\rm null}|C)$ can not been regarded as $H(Y_{\\rm null})$.\n4) Based on 1), 2), and 3), we can not regard $H(\\hat C|C) + H(Y_{\\rm null})$ as quantifying the uncertainty and information loss related to the aggregation process.\n5) For Diversity $H(Y)$, the author still assume Y as a Gaussian distribution, this assume is meanful only for Regression Problem, not for Classification Problem.\n\nFor **Global Response (2-2/4, Revised)**:\n\n1) The authors claim that minimizing $H(\\hat C|C)$ via Correlation Maximization can be seen as Covariate shift-invariant Distributional Alignment. This is puzzling. The Covariate Shift problem is related to the distribution divergence between the training dataset and the test dataset. However, this paper only focus on training dataset. Also, I read the whole article carefully, and the author do not analyze what confounders caused the distribution shift, nor do he propose a method to extract such confounders. So innovation on this point is overclaimed.\n\n2) The formulation of $H(Y_{\\rm null})$ is still based on the assumption of a Gaussian distribution. Meanwhile, how can you be sure that $H(Y_{\\rm null})$ contains information that is not relevant to the task?\n\nFor **Contribution**:\n\n1) The novlty of this paper is incremental. The claim for solving the covariate shift in this paper is problematic. \n\nThus, I maintain my original rating."}, {"title": null, "comment": "Thanks for your response. My concern regarding the performance is somewhat addressed, but the novelty of this work based on Barlow Twins still seems incremental. Additionally, I see that Reviewer UtBt expressed the concern about the Gaussian distribution for class variables, which I agree is problematic."}, {"title": null, "comment": "Thank you for your answers. The current theoretical analysis assumes the Gaussian distribution for class variables: \"both $C$ and $\\hat{C}$ are Gaussian-distributed\" in the reply. Since class variables take discrete values, the assumption has some gaps even though the analysis provides some insight into the proposed method. Apart from that, the paper could be improved based on the answers and the other reviews. I will thus keep my score."}, {"title": null, "comment": "For W2 and G4, even with careful choice of hyperparameters, the improvement of the in-domain performance of SupDCL against SupCon is marginal (78.2 vs 77.9), and it still underperforms more recent methods significantly such as GPaCo (78.2 vs 79.5).\n\nFor W3, SupDCL can be seen as Barlow Twins + Supervision + Orthogonal Regularization, leaving the contribution of SupDCL questionable. Additionally, the results of Table A are on CIFAR-100 instead of ImageNet, making it inconvincing.\n\nI am still not convinced about the novelty and performance. Therefore, I will keep my original rating."}, {"title": "Response to Rebuttal", "comment": "**For G2**\n\n1. As for the sentence: \"A is full-rank, the transformation is bijective\", it is problematic. Bijection can only be guaranteed if A is A square matrix and A is invertible.\n\n2. The assumption that labels are published in a Gaussian distribution is somewhat difficult to understand.\n\n3. The proof of 'Orthogonal Regularization' is built on 'A is square matrix'.\n\nSo, I think G2 is unconvincing.\n\n\n**For  CLASS CORRELATION**\n\nWhat I'm trying to say is that correlation doesn't mean equality. Only the correlation between labels is restricted, and discriminability is not restricted. Therefore, the claim in L229-232 is overclaimed.\n\n**Overall**\n\nSome important concerns have not been addressed well. So, I keep my original rating."}]}, "decision": null, "pdf": "E:\\home\\ananth\\data\\ICLR_2025\\pdfs\\0a5cd4a358db1be048daf20df92d0b46adb0b9db.pdf", "json": "E:\\home\\ananth\\data\\ICLR_2025\\jsons\\0a5cd4a358db1be048daf20df92d0b46adb0b9db.json"}